#include "DirectXCommon.h"
void DirectXCommon::Initialize() {
//デバイスの生成//

//============//

//コマンド関連の生成//

//================//

//スワップチェーンの生成//

//====================//

//深度バッファ//

//===========//

//各種デスクリプターヒープの生成//

//===========================//

//レンダーターゲットビューの初期化//

//=============================//

//深度ステンシルビューの初期化//

//=========================//

//フェンスの生成//

//=============//

//ビューポート矩形の初期化//

//=====================//

//シザリング矩形の生成//

//==================//

//DCXコンパイラの生成//

//=================//

//ImGuiの初期化//

//============//
}